In [1]:
import pandas as pd
import numpy as np

In [6]:
#series
s= pd.Series([4,5,20,24,50,78,98,12,7])
print('s',s)

s 0     4
1     5
2    20
3    24
4    50
5    78
6    98
7    12
8     7
dtype: int64

In [8]:
s[1]=20

In [9]:
s

0     4
1    20
2    20
3    24
4    50
5    78
6    98
7    12
8     7
dtype: int64

In [10]:
s[0]= 50

In [11]:
s

0    50
1    20
2    20
3    24
4    50
5    78
6    98
7    12
8     7
dtype: int64

In [13]:
s.shape, s.size, s.dtype, s.values #to convert into array form

((9,),
 9,
 dtype('int64'),
 array([50, 20, 20, 24, 50, 78, 98, 12,  7], dtype=int64))

In [33]:
# Data Frames
r = pd.Series([1,2,3,4,5])
n = pd.Series(['Nitin','Ranjan','Rani','Priya','Manoj'])
m = pd.Series([80,82,93,74,95])

In [34]:
df = pd.DataFrame({'Roll':r, 'Name':n, 'Marks':m})

In [35]:
df

   Roll    Name  Marks
0     1   Nitin     80
1     2  Ranjan     82
2     3    Rani     93
3     4   Priya     74
4     5   Manoj     95

In [36]:
df.size

15

In [38]:
df.shape

(5, 3)

In [39]:
df.values

array([[1, 'Nitin', 80],
       [2, 'Ranjan', 82],
       [3, 'Rani', 93],
       [4, 'Priya', 74],
       [5, 'Manoj', 95]], dtype=object)

In [46]:
type(df)

pandas.core.frame.DataFrame

In [88]:
# load the data using pandas
df = pd.read_csv('datasets/student.csv')

In [89]:
print('DataSet\n', df)

DataSet
    roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [45]:
type(df)

pandas.core.frame.DataFrame

In [47]:
# load the data using pandas, header not found
df = pd.read_csv('datasets/student1.csv')
print('DataSet\n', df)

DataSet
     1     anil  TE  56.77  22
0   2     amit  TE  59.77  21
1   3   aniket  BE  76.88  19
2   4  ajinkya  TE  69.66  20
3   5     asha  TE  63.28  20
4   6   ayesha  BE  49.55  20
5   7     amar  BE  65.34  19
6   8    amita  BE  68.33  23
7   9     amol  TE  56.75  20
8  10    anmol  BE  78.66  21

In [49]:
#adding header to the dataset with some numes
df = pd.read_csv('datasets/student1.csv', names = ['Roll', 'Name', 'Class', 'Marks', 'Age'] )
print('DataSet\n', df)

DataSet
    Roll     Name Class  Marks  Age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [50]:
t = None

In [53]:
#adding header to the dataset without any name
df2 = pd.read_csv('datasets/student1.csv', header = None )
print('DataSet\n', df2)

DataSet
     0        1   2      3   4
0   1     anil  TE  56.77  22
1   2     amit  TE  59.77  21
2   3   aniket  BE  76.88  19
3   4  ajinkya  TE  69.66  20
4   5     asha  TE  63.28  20
5   6   ayesha  BE  49.55  20
6   7     amar  BE  65.34  19
7   8    amita  BE  68.33  23
8   9     amol  TE  56.75  20
9  10    anmol  BE  78.66  21

In [54]:
# load the data using pandas , separator is \
df3 = pd.read_csv('datasets/student3.tsv')
print('DataSet\n', df3)

DataSet
   roll\tname\tclass\tmarks\tage
0        1\tanil\tTE\t56.77\t22
1        2\tamit\tTE\t59.77\t21
2      3\taniket\tBE\t76.88\t19
3     4\tajinkya\tTE\t69.66\t20
4        5\tasha\tTE\t63.28\t20
5      6\tayesha\tBE\t49.55\t20
6        7\tamar\tBE\t65.34\t19
7       8\tamita\tBE\t68.33\t23
8        9\tamol\tTE\t56.75\t20
9      10\tanmol\tBE\t78.66\t21

In [55]:
df3 = pd.read_csv('datasets/student3.tsv', sep = '\t') #separator is \ changed into comma(,) or space
print('DataSet\n', df3)

DataSet
    roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [56]:
df4 = pd.read_csv('https://raw.githubusercontent.com/mwaskom/seaborn-data/master/iris.csv') # downloaded a data from internet
print('DataSet\n', df4)

DataSet
      sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [57]:
df4.shape #shape

(150, 5)

In [60]:
df4.size, type(df4), df4.shape, df4.dtypes

(750,
 pandas.core.frame.DataFrame,
 (150, 5),
 sepal_length    float64
 sepal_width     float64
 petal_length    float64
 petal_width     float64
 species          object
 dtype: object)

In [62]:
df4.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [63]:
df4.index

RangeIndex(start=0, stop=150, step=1)

In [64]:
df4.values # converts dataset into array of list

array([[5.1, 3.5, 1.4, 0.2, 'setosa'],
       [4.9, 3.0, 1.4, 0.2, 'setosa'],
       [4.7, 3.2, 1.3, 0.2, 'setosa'],
       [4.6, 3.1, 1.5, 0.2, 'setosa'],
       [5.0, 3.6, 1.4, 0.2, 'setosa'],
       [5.4, 3.9, 1.7, 0.4, 'setosa'],
       [4.6, 3.4, 1.4, 0.3, 'setosa'],
       [5.0, 3.4, 1.5, 0.2, 'setosa'],
       [4.4, 2.9, 1.4, 0.2, 'setosa'],
       [4.9, 3.1, 1.5, 0.1, 'setosa'],
       [5.4, 3.7, 1.5, 0.2, 'setosa'],
       [4.8, 3.4, 1.6, 0.2, 'setosa'],
       [4.8, 3.0, 1.4, 0.1, 'setosa'],
       [4.3, 3.0, 1.1, 0.1, 'setosa'],
       [5.8, 4.0, 1.2, 0.2, 'setosa'],
       [5.7, 4.4, 1.5, 0.4, 'setosa'],
       [5.4, 3.9, 1.3, 0.4, 'setosa'],
       [5.1, 3.5, 1.4, 0.3, 'setosa'],
       [5.7, 3.8, 1.7, 0.3, 'setosa'],
       [5.1, 3.8, 1.5, 0.3, 'setosa'],
       [5.4, 3.4, 1.7, 0.2, 'setosa'],
       [5.1, 3.7, 1.5, 0.4, 'setosa'],
       [4.6, 3.6, 1.0, 0.2, 'setosa'],
       [5.1, 3.3, 1.7, 0.5, 'setosa'],
       [4.8, 3.4, 1.9, 0.2, 'setosa'],
       [5.0, 3.0, 1.6, 0.2, 'setosa'],
       [5.0, 3.4, 1.6, 0.4, 'setosa'],
       [5.2, 3.5, 1.5, 0.2, 'setosa'],
       [5.2, 3.4, 1.4, 0.2, 'setosa'],
       [4.7, 3.2, 1.6, 0.2, 'setosa'],
       [4.8, 3.1, 1.6, 0.2, 'setosa'],
       [5.4, 3.4, 1.5, 0.4, 'setosa'],
       [5.2, 4.1, 1.5, 0.1, 'setosa'],
       [5.5, 4.2, 1.4, 0.2, 'setosa'],
       [4.9, 3.1, 1.5, 0.2, 'setosa'],
       [5.0, 3.2, 1.2, 0.2, 'setosa'],
       [5.5, 3.5, 1.3, 0.2, 'setosa'],
       [4.9, 3.6, 1.4, 0.1, 'setosa'],
       [4.4, 3.0, 1.3, 0.2, 'setosa'],
       [5.1, 3.4, 1.5, 0.2, 'setosa'],
       [5.0, 3.5, 1.3, 0.3, 'setosa'],
       [4.5, 2.3, 1.3, 0.3, 'setosa'],
       [4.4, 3.2, 1.3, 0.2, 'setosa'],
       [5.0, 3.5, 1.6, 0.6, 'setosa'],
       [5.1, 3.8, 1.9, 0.4, 'setosa'],
       [4.8, 3.0, 1.4, 0.3, 'setosa'],
       [5.1, 3.8, 1.6, 0.2, 'setosa'],
       [4.6, 3.2, 1.4, 0.2, 'setosa'],
       [5.3, 3.7, 1.5, 0.2, 'setosa'],
       [5.0, 3.3, 1.4, 0.2, 'setosa'],
       [7.0, 3.2, 4.7, 1.4, 'versicolor'],
       [6.4, 3.2, 4.5, 1.5, 'versicolor'],
       [6.9, 3.1, 4.9, 1.5, 'versicolor'],
       [5.5, 2.3, 4.0, 1.3, 'versicolor'],
       [6.5, 2.8, 4.6, 1.5, 'versicolor'],
       [5.7, 2.8, 4.5, 1.3, 'versicolor'],
       [6.3, 3.3, 4.7, 1.6, 'versicolor'],
       [4.9, 2.4, 3.3, 1.0, 'versicolor'],
       [6.6, 2.9, 4.6, 1.3, 'versicolor'],
       [5.2, 2.7, 3.9, 1.4, 'versicolor'],
       [5.0, 2.0, 3.5, 1.0, 'versicolor'],
       [5.9, 3.0, 4.2, 1.5, 'versicolor'],
       [6.0, 2.2, 4.0, 1.0, 'versicolor'],
       [6.1, 2.9, 4.7, 1.4, 'versicolor'],
       [5.6, 2.9, 3.6, 1.3, 'versicolor'],
       [6.7, 3.1, 4.4, 1.4, 'versicolor'],
       [5.6, 3.0, 4.5, 1.5, 'versicolor'],
       [5.8, 2.7, 4.1, 1.0, 'versicolor'],
       [6.2, 2.2, 4.5, 1.5, 'versicolor'],
       [5.6, 2.5, 3.9, 1.1, 'versicolor'],
       [5.9, 3.2, 4.8, 1.8, 'versicolor'],
       [6.1, 2.8, 4.0, 1.3, 'versicolor'],
       [6.3, 2.5, 4.9, 1.5, 'versicolor'],
       [6.1, 2.8, 4.7, 1.2, 'versicolor'],
       [6.4, 2.9, 4.3, 1.3, 'versicolor'],
       [6.6, 3.0, 4.4, 1.4, 'versicolor'],
       [6.8, 2.8, 4.8, 1.4, 'versicolor'],
       [6.7, 3.0, 5.0, 1.7, 'versicolor'],
       [6.0, 2.9, 4.5, 1.5, 'versicolor'],
       [5.7, 2.6, 3.5, 1.0, 'versicolor'],
       [5.5, 2.4, 3.8, 1.1, 'versicolor'],
       [5.5, 2.4, 3.7, 1.0, 'versicolor'],
       [5.8, 2.7, 3.9, 1.2, 'versicolor'],
       [6.0, 2.7, 5.1, 1.6, 'versicolor'],
       [5.4, 3.0, 4.5, 1.5, 'versicolor'],
       [6.0, 3.4, 4.5, 1.6, 'versicolor'],
       [6.7, 3.1, 4.7, 1.5, 'versicolor'],
       [6.3, 2.3, 4.4, 1.3, 'versicolor'],
       [5.6, 3.0, 4.1, 1.3, 'versicolor'],
       [5.5, 2.5, 4.0, 1.3, 'versicolor'],
       [5.5, 2.6, 4.4, 1.2, 'versicolor'],
       [6.1, 3.0, 4.6, 1.4, 'versicolor'],
       [5.8, 2.6, 4.0, 1.2, 'versicolor'],
       [5.0, 2.3, 3.3, 1.0, 'versicolor'],
       [5.6, 2.7, 4.2, 1.3, 'versicolor'],
       [5.7, 3.0, 4.2, 1.2, 'versicolor'],
       [5.7, 2.9, 4.2, 1.3, 'versicolor'],
       [6.2, 2.9, 4.3, 1.3, 'versicolor'],
       [5.1, 2.5, 3.0, 1.1, 'versicolor'],
       [5.7, 2.8, 4.1, 1.3, 'versicolor'],
       [6.3, 3.3, 6.0, 2.5, 'virginica'],
       [5.8, 2.7, 5.1, 1.9, 'virginica'],
       [7.1, 3.0, 5.9, 2.1, 'virginica'],
       [6.3, 2.9, 5.6, 1.8, 'virginica'],
       [6.5, 3.0, 5.8, 2.2, 'virginica'],
       [7.6, 3.0, 6.6, 2.1, 'virginica'],
       [4.9, 2.5, 4.5, 1.7, 'virginica'],
       [7.3, 2.9, 6.3, 1.8, 'virginica'],
       [6.7, 2.5, 5.8, 1.8, 'virginica'],
       [7.2, 3.6, 6.1, 2.5, 'virginica'],
       [6.5, 3.2, 5.1, 2.0, 'virginica'],
       [6.4, 2.7, 5.3, 1.9, 'virginica'],
       [6.8, 3.0, 5.5, 2.1, 'virginica'],
       [5.7, 2.5, 5.0, 2.0, 'virginica'],
       [5.8, 2.8, 5.1, 2.4, 'virginica'],
       [6.4, 3.2, 5.3, 2.3, 'virginica'],
       [6.5, 3.0, 5.5, 1.8, 'virginica'],
       [7.7, 3.8, 6.7, 2.2, 'virginica'],
       [7.7, 2.6, 6.9, 2.3, 'virginica'],
       [6.0, 2.2, 5.0, 1.5, 'virginica'],
       [6.9, 3.2, 5.7, 2.3, 'virginica'],
       [5.6, 2.8, 4.9, 2.0, 'virginica'],
       [7.7, 2.8, 6.7, 2.0, 'virginica'],
       [6.3, 2.7, 4.9, 1.8, 'virginica'],
       [6.7, 3.3, 5.7, 2.1, 'virginica'],
       [7.2, 3.2, 6.0, 1.8, 'virginica'],
       [6.2, 2.8, 4.8, 1.8, 'virginica'],
       [6.1, 3.0, 4.9, 1.8, 'virginica'],
       [6.4, 2.8, 5.6, 2.1, 'virginica'],
       [7.2, 3.0, 5.8, 1.6, 'virginica'],
       [7.4, 2.8, 6.1, 1.9, 'virginica'],
       [7.9, 3.8, 6.4, 2.0, 'virginica'],
       [6.4, 2.8, 5.6, 2.2, 'virginica'],
       [6.3, 2.8, 5.1, 1.5, 'virginica'],
       [6.1, 2.6, 5.6, 1.4, 'virginica'],
       [7.7, 3.0, 6.1, 2.3, 'virginica'],
       [6.3, 3.4, 5.6, 2.4, 'virginica'],
       [6.4, 3.1, 5.5, 1.8, 'virginica'],
       [6.0, 3.0, 4.8, 1.8, 'virginica'],
       [6.9, 3.1, 5.4, 2.1, 'virginica'],
       [6.7, 3.1, 5.6, 2.4, 'virginica'],
       [6.9, 3.1, 5.1, 2.3, 'virginica'],
       [5.8, 2.7, 5.1, 1.9, 'virginica'],
       [6.8, 3.2, 5.9, 2.3, 'virginica'],
       [6.7, 3.3, 5.7, 2.5, 'virginica'],
       [6.7, 3.0, 5.2, 2.3, 'virginica'],
       [6.3, 2.5, 5.0, 1.9, 'virginica'],
       [6.5, 3.0, 5.2, 2.0, 'virginica'],
       [6.2, 3.4, 5.4, 2.3, 'virginica'],
       [5.9, 3.0, 5.1, 1.8, 'virginica']], dtype=object)

In [65]:
df4.T, #converts columns into rows

,0,1,2,3,4,5,6,7,8,9,...,140,141,142,143,144,145,146,147,148,149
sepal_length,5.1,4.9,4.7,4.6,5.0,5.4,4.6,5.0,4.4,4.9,...,6.7,6.9,5.8,6.8,6.7,6.7,6.3,6.5,6.2,5.9
sepal_width,3.5,3.0,3.2,3.1,3.6,3.9,3.4,3.4,2.9,3.1,...,3.1,3.1,2.7,3.2,3.3,3.0,2.5,3.0,3.4,3.0
petal_length,1.4,1.4,1.3,1.5,1.4,1.7,1.4,1.5,1.4,1.5,...,5.6,5.1,5.1,5.9,5.7,5.2,5.0,5.2,5.4,5.1
petal_width,0.2,0.2,0.2,0.2,0.2,0.4,0.3,0.2,0.2,0.1,...,2.4,2.3,1.9,2.3,2.5,2.3,1.9,2.0,2.3,1.8
species,setosa,setosa,setosa,setosa,setosa,setosa,setosa,setosa,setosa,setosa,...,virginica,virginica,virginica,virginica,virginica,virginica,virginica,virginica,virginica,virginica

In [66]:
df4.head() #first five rows of the information (default)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [67]:
df4.head(10) #first 10 rows of the information

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa
6           4.6          3.4           1.4          0.3  setosa
7           5.0          3.4           1.5          0.2  setosa
8           4.4          2.9           1.4          0.2  setosa
9           4.9          3.1           1.5          0.1  setosa

In [68]:
df4.tail(10) #last 10 rows of the information

     sepal_length  sepal_width  petal_length  petal_width    species
140           6.7          3.1           5.6          2.4  virginica
141           6.9          3.1           5.1          2.3  virginica
142           5.8          2.7           5.1          1.9  virginica
143           6.8          3.2           5.9          2.3  virginica
144           6.7          3.3           5.7          2.5  virginica
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [75]:
xx = df.iloc[3:8, 1:3]
print('Index based slicing of DataSet\n', xx)

Index based slicing of DataSet
          1   2
3  ajinkya  TE
4     asha  TE
5   ayesha  BE
6     amar  BE
7    amita  BE

In [76]:
xx = df.iloc[3:, 1:3] #starting from 3rd row till end and columns from 1 to 3
print('Index based slicing of DataSet\n', xx)

Index based slicing of DataSet
          1   2
3  ajinkya  TE
4     asha  TE
5   ayesha  BE
6     amar  BE
7    amita  BE
8     amol  TE
9    anmol  BE

In [77]:
xx = df.iloc[3:, 1:] #starting from 3rd row till end and columns from 1 till end
print('Index based slicing of DataSet\n', xx)

Index based slicing of DataSet
          1   2      3   4
3  ajinkya  TE  69.66  20
4     asha  TE  63.28  20
5   ayesha  BE  49.55  20
6     amar  BE  65.34  19
7    amita  BE  68.33  23
8     amol  TE  56.75  20
9    anmol  BE  78.66  21

In [78]:
xx = df.iloc[[3,5,8,9], :] #Random selection of the rows and all the columns
print('Index based slicing of DataSet\n', xx)

Index based slicing of DataSet
     0        1   2      3   4
3   4  ajinkya  TE  69.66  20
5   6   ayesha  BE  49.55  20
8   9     amol  TE  56.75  20
9  10    anmol  BE  78.66  21

In [79]:
xx = df.iloc[[3,5,8,9], [1,3,4]] #Random selection of the rows and columns
print('Index based slicing of DataSet\n', xx)

Index based slicing of DataSet
          1      3   4
3  ajinkya  69.66  20
5   ayesha  49.55  20
8     amol  56.75  20
9    anmol  78.66  21

In [80]:
xx = df.iloc[4, :] #Random selection of 4th row and all the columns
print('Index based slicing of DataSet\n', xx)

Index based slicing of DataSet
 0        5
1     asha
2       TE
3    63.28
4       20
Name: 4, dtype: object

In [81]:
xx = df.iloc[ :, 1] #Random selection of all row and 1st column
print('Index based slicing of DataSet\n', xx)

Index based slicing of DataSet
 0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: 1, dtype: object

In [82]:
xx = df.iloc[3,1] #Random selection of a row and a column
print('Index based slicing of DataSet\n', xx)

Index based slicing of DataSet
 ajinkya

In [98]:
# label based slicing
xx1 = df[['name', 'marks','age']]
print('label slicing of DataSet\n', xx1)

label slicing of DataSet
       name  marks  age
0     anil  56.77   22
1     amit  59.77   21
2   aniket  76.88   19
3  ajinkya  69.66   20
4     asha  63.28   20
5   ayesha  49.55   20
6     amar  65.34   19
7    amita  68.33   23
8     amol  56.75   20
9    anmol  78.66   21

In [101]:
# label based slicing
xx1 = df.loc[:, ['name', 'marks', 'age']]
print('label slicing of DataSet\n', xx1)

label slicing of DataSet
       name  marks  age
0     anil  56.77   22
1     amit  59.77   21
2   aniket  76.88   19
3  ajinkya  69.66   20
4     asha  63.28   20
5   ayesha  49.55   20
6     amar  65.34   19
7    amita  68.33   23
8     amol  56.75   20
9    anmol  78.66   21

In [95]:
df.name.values

array(['anil', 'amit', 'aniket', 'ajinkya', 'asha', 'ayesha', 'amar',
       'amita', 'amol', 'anmol'], dtype=object)

In [102]:
xx2 = df.drop(5) # 5 index is dropped from row
print('label slicing of DataSet\n', xx2)

label slicing of DataSet
    roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [103]:
xx2 = df.drop([5, 6, 7]) # 5 6 7index are dropped from row
print('label slicing of DataSet\n', xx2)

label slicing of DataSet
    roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [104]:
xx2 = df.drop('class', axis = 1) # class index is dropped from column
print('label slicing of DataSet\n', xx2)

label slicing of DataSet
    roll     name  marks  age
0     1     anil  56.77   22
1     2     amit  59.77   21
2     3   aniket  76.88   19
3     4  ajinkya  69.66   20
4     5     asha  63.28   20
5     6   ayesha  49.55   20
6     7     amar  65.34   19
7     8    amita  68.33   23
8     9     amol  56.75   20
9    10    anmol  78.66   21

In [105]:
xx2 = df.drop(['class', 'age'], axis = 1) # class index is dropped from column
print('label slicing of DataSet\n', xx2)

label slicing of DataSet
    roll     name  marks
0     1     anil  56.77
1     2     amit  59.77
2     3   aniket  76.88
3     4  ajinkya  69.66
4     5     asha  63.28
5     6   ayesha  49.55
6     7     amar  65.34
7     8    amita  68.33
8     9     amol  56.75
9    10    anmol  78.66

In [106]:
xx2.shape

(10, 3)

In [ ]:
#xx2 = df.drop(['class', 'age'], axis = 1, inplace = True) # to change the new_df

In [110]:
df['marks'].min(), df['marks'].max(), df['marks'].mean(), df['marks'].median(), df['marks'].sum(), df['marks'].std(), df['marks'].count()

(49.55, 78.66, 64.499, 64.31, 644.9899999999999, 9.207178901994535, 10)

In [112]:
df.count(), df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   roll    10 non-null     int64
 1   name    10 non-null     object
 2   class   10 non-null     object
 3   marks   10 non-null     float64
 4   age     10 non-null     int64
dtypes: float64(1), int64(2), object(2)
memory usage: 532.0+ bytes

(roll     10
 name     10
 class    10
 marks    10
 age      10
 dtype: int64,
 None)

In [113]:
df.describe() #to describe the numerical data

           roll      marks        age
count  10.00000  10.000000  10.000000
mean    5.50000  64.499000  20.500000
std     3.02765   9.207179   1.269296
min     1.00000  49.550000  19.000000
25%     3.25000  57.520000  20.000000
50%     5.50000  64.310000  20.000000
75%     7.75000  69.327500  21.000000
max    10.00000  78.660000  23.000000

In [115]:
df.max(), df.min(), df.std(numeric_only = True)

(roll         10
 name     ayesha
 class        TE
 marks     78.66
 age          23
 dtype: object,
 roll           1
 name     ajinkya
 class         BE
 marks      49.55
 age           19
 dtype: object,
 roll     3.027650
 marks    9.207179
 age      1.269296
 dtype: float64)

In [116]:
df.sum(axis = 1, numeric_only = True) #addition of numeric data

0     79.77
1     82.77
2     98.88
3     93.66
4     88.28
5     75.55
6     91.34
7     99.33
8     85.75
9    109.66
dtype: float64

In [117]:
df['class'].value_counts() #classification of data class

class
TE    5
BE    5
Name: count, dtype: int64

In [118]:
df['age'].value_counts() #classification of data age

age
20    4
21    2
19    2
22    1
23    1
Name: count, dtype: int64

In [119]:
df['marks'].value_counts() #classification of data marks

marks
56.77    1
59.77    1
76.88    1
69.66    1
63.28    1
49.55    1
65.34    1
68.33    1
56.75    1
78.66    1
Name: count, dtype: int64

In [123]:
df.sort_values(['class','marks'])

   roll     name class  marks  age
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
2     3   aniket    BE  76.88   19
9    10    anmol    BE  78.66   21
8     9     amol    TE  56.75   20
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
4     5     asha    TE  63.28   20
3     4  ajinkya    TE  69.66   20

In [125]:
df.sort_values(['class','marks', 'age'], ascending = False)

   roll     name class  marks  age
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
1     2     amit    TE  59.77   21
0     1     anil    TE  56.77   22
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21
2     3   aniket    BE  76.88   19
7     8    amita    BE  68.33   23
6     7     amar    BE  65.34   19
5     6   ayesha    BE  49.55   20

In [127]:
# custom column operator
df['marks'] = df['marks']+2

In [128]:
df

   roll     name class  marks  age
0     1     anil    TE  58.77   22
1     2     amit    TE  61.77   21
2     3   aniket    BE  78.88   19
3     4  ajinkya    TE  71.66   20
4     5     asha    TE  65.28   20
5     6   ayesha    BE  51.55   20
6     7     amar    BE  67.34   19
7     8    amita    BE  70.33   23
8     9     amol    TE  58.75   20
9    10    anmol    BE  80.66   21

In [129]:
df['cgpa'] = df['marks']/10+0.034 #extra column creation

In [130]:
df

   roll     name class  marks  age   cgpa
0     1     anil    TE  58.77   22  5.911
1     2     amit    TE  61.77   21  6.211
2     3   aniket    BE  78.88   19  7.922
3     4  ajinkya    TE  71.66   20  7.200
4     5     asha    TE  65.28   20  6.562
5     6   ayesha    BE  51.55   20  5.189
6     7     amar    BE  67.34   19  6.768
7     8    amita    BE  70.33   23  7.067
8     9     amol    TE  58.75   20  5.909
9    10    anmol    BE  80.66   21  8.100

In [131]:
df['I_class'] = df['marks']>70
print('DataSet\n', df)

DataSet
    roll     name class  marks  age   cgpa  I_class
0     1     anil    TE  58.77   22  5.911    False
1     2     amit    TE  61.77   21  6.211    False
2     3   aniket    BE  78.88   19  7.922     True
3     4  ajinkya    TE  71.66   20  7.200     True
4     5     asha    TE  65.28   20  6.562    False
5     6   ayesha    BE  51.55   20  5.189    False
6     7     amar    BE  67.34   19  6.768    False
7     8    amita    BE  70.33   23  7.067     True
8     9     amol    TE  58.75   20  5.909    False
9    10    anmol    BE  80.66   21  8.100     True

In [132]:
x = ['M','M','M','M','F', 'F','M','F','M','M']
df['gender'] = x
print('DataSet\n', df)

DataSet
    roll     name class  marks  age   cgpa  I_class gender
0     1     anil    TE  58.77   22  5.911    False      M
1     2     amit    TE  61.77   21  6.211    False      M
2     3   aniket    BE  78.88   19  7.922     True      M
3     4  ajinkya    TE  71.66   20  7.200     True      M
4     5     asha    TE  65.28   20  6.562    False      F
5     6   ayesha    BE  51.55   20  5.189    False      F
6     7     amar    BE  67.34   19  6.768    False      M
7     8    amita    BE  70.33   23  7.067     True      F
8     9     amol    TE  58.75   20  5.909    False      M
9    10    anmol    BE  80.66   21  8.100     True      M

In [134]:
ndf = pd.DataFrame({
       'roll':range(1,11),
       'cgpa':df['marks']/10+0.034,
       'gender':['M','M','M','M','F', 'F','M','F','M','M']
})
df = pd.read_csv('datasets/student.csv')
print('ndf\n',ndf)
print('df\n',df)

ndf
    roll   cgpa gender
0     1  5.711      M
1     2  6.011      M
2     3  7.722      M
3     4  7.000      M
4     5  6.362      F
5     6  4.989      F
6     7  6.568      M
7     8  6.867      F
8     9  5.709      M
9    10  7.900      M
df
    roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [136]:
df1 = df.merge(ndf, on = 'roll') #joining two data sets or merging to 
print('Merging using common roll\n', df1)

Merging using common roll
    roll     name class  marks  age   cgpa gender
0     1     anil    TE  56.77   22  5.711      M
1     2     amit    TE  59.77   21  6.011      M
2     3   aniket    BE  76.88   19  7.722      M
3     4  ajinkya    TE  69.66   20  7.000      M
4     5     asha    TE  63.28   20  6.362      F
5     6   ayesha    BE  49.55   20  4.989      F
6     7     amar    BE  65.34   19  6.568      M
7     8    amita    BE  68.33   23  6.867      F
8     9     amol    TE  56.75   20  5.709      M
9    10    anmol    BE  78.66   21  7.900      M

In [137]:
df5 = pd.read_csv('datasets/student5.csv')
print('Dataset\n', df5)

Dataset
    roll     name class  marks  age
0     1   surbhi    TE  67.44   23
1     2    sujay    TE  74.12   22
2     3  subhash    BE  82.44   21
3     4   sachin    TE  59.33   21
4     5  shalini    TE  63.45   20

In [140]:
df6 = pd.concat([df, df5], ignore_index = True)
print('Dataset concatanation\n', df6)

Dataset concatanation
     roll     name class  marks  age
0      1     anil    TE  56.77   22
1      2     amit    TE  59.77   21
2      3   aniket    BE  76.88   19
3      4  ajinkya    TE  69.66   20
4      5     asha    TE  63.28   20
5      6   ayesha    BE  49.55   20
6      7     amar    BE  65.34   19
7      8    amita    BE  68.33   23
8      9     amol    TE  56.75   20
9     10    anmol    BE  78.66   21
10     1   surbhi    TE  67.44   23
11     2    sujay    TE  74.12   22
12     3  subhash    BE  82.44   21
13     4   sachin    TE  59.33   21
14     5  shalini    TE  63.45   20

In [141]:
# String operation
name = 'CDAC'

In [142]:
name.casefold()

'cdac'

In [145]:
name.count('C')

2

In [146]:
df['name'].str.casefold()

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [148]:
df['name'].str.capitalize()

0       Anil
1       Amit
2     Aniket
3    Ajinkya
4       Asha
5     Ayesha
6       Amar
7      Amita
8       Amol
9      Anmol
Name: name, dtype: object

In [149]:
df['name'].str.startswith('an')

0     True
1    False
2     True
3    False
4    False
5    False
6    False
7    False
8    False
9     True
Name: name, dtype: bool

In [150]:
df['name'].str.replace('i', 'ee')

0       aneel
1       ameet
2     aneeket
3    ajeenkya
4        asha
5      ayesha
6        amar
7      ameeta
8        amol
9       anmol
Name: name, dtype: object

In [151]:
df['name'].str.upper()

0       ANIL
1       AMIT
2     ANIKET
3    AJINKYA
4       ASHA
5     AYESHA
6       AMAR
7      AMITA
8       AMOL
9      ANMOL
Name: name, dtype: object

In [152]:
df['name'].str.find('i')

0    2
1    2
2    2
3    2
4   -1
5   -1
6   -1
7    2
8   -1
9   -1
Name: name, dtype: int64

In [153]:
df['name'].str.isalpha()

0    True
1    True
2    True
3    True
4    True
5    True
6    True
7    True
8    True
9    True
Name: name, dtype: bool

In [159]:
# grouping and aggregation
gr = df.groupby('class')
gr.groups

{'BE': [2, 5, 6, 7, 9], 'TE': [0, 1, 3, 4, 8]}

In [160]:
gr_te = gr.get_group('TE')
print('Dataset of TE group\n', gr_te)

Dataset of TE group
    roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
8     9     amol    TE  56.75   20

In [161]:
gr_be = gr.get_group('BE')
print('Dataset of BE group\n', gr_be)

Dataset of BE group
    roll    name class  marks  age
2     3  aniket    BE  76.88   19
5     6  ayesha    BE  49.55   20
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
9    10   anmol    BE  78.66   21

In [163]:
gr_te['marks'].max(), gr_te['marks'].min()

(69.66, 56.75)

In [164]:
gr_be['marks'].max(),gr_be['marks'].min()

(78.66, 49.55)

In [ ]:
# boolean operation

In [165]:
mask = df['marks']>60
print('Dataset of marks above 60\n', mask)

Dataset of marks above 60
 0    False
1    False
2     True
3     True
4     True
5    False
6     True
7     True
8    False
9     True
Name: marks, dtype: bool

In [167]:
mask = df[df['marks']>60]
print('Dataset of marks above 60\n', mask)

Dataset of marks above 60
    roll     name class  marks  age
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
9    10    anmol    BE  78.66   21

In [170]:
name_mask = df[df['name'].str.startswith('an')]
print('Dataset of names with an\n', name_mask)

Dataset of names with an
    roll    name class  marks  age
0     1    anil    TE  56.77   22
2     3  aniket    BE  76.88   19
9    10   anmol    BE  78.66   21

In [186]:
x = df[(df['marks'] > 60) & (df['class']=='TE')]
print('dataout', x)

dataout    roll     name class  marks  age
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20

In [187]:
x.to_csv('datasets/x.csv')

In [189]:
x.to_html('datasets/x.html')